Расширения/РасширениеAPI/InformationRegisters/СостоянияЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЭД</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеВерсииЭД</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсийЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЭлектронныхДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширения/РасширениеAPI/CommonModules/ОбменСКонтрагентамиСлужебный/Ext/Module.bsl
&Вместо("ПроверитьНаличиеИУдалитьСостояниеДокумента")
Процедура ЭксклюзивAPI_ПроверитьНаличиеИУдалитьСостояниеДокумента(СсылкаНаОбъект)
	//Глушим, чтобы статус не слетал
	
	//ПродолжитьВызов(СсылкаНаОбъект);
	
	//Притула Р.В. Начало 13.08.2018 #2678
	//будем помечать в комментарии состояние пометки удаления и проведения на момент записи
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЭтоСправочник = Истина;
	Иначе
		ЭтоСправочник = Ложь;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.СостоянияЭД.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СсылкаНаОбъект = СсылкаНаОбъект;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ЭтоСправочник Тогда
			Если СсылкаНаОбъект.ПометкаУдаления = МенеджерЗаписи.Комментарий <> "ПометкаУдаления = Истина" Тогда
				МенеджерЗаписи.Комментарий = ?(СсылкаНаОбъект.ПометкаУдаления,"ПометкаУдаления = Истина","");
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			КонецЕсли;	
		Иначе	
			Если СсылкаНаОбъект.ПометкаУдаления И Не МенеджерЗаписи.Комментарий = "ПометкаУдаления = Истина" Тогда
				МенеджерЗаписи.Комментарий = "ПометкаУдаления = Истина";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			ИначеЕсли СсылкаНаОбъект.Проведен И (МенеджерЗаписи.Комментарий = "ПометкаУдаления = Истина" ИЛИ МенеджерЗаписи.Комментарий = "Проведен = Ложь") Тогда
				МенеджерЗаписи.Комментарий = "";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			ИначеЕсли Не СсылкаНаОбъект.Проведен И МенеджерЗаписи.Комментарий <> "Проведен = Ложь" Тогда
				МенеджерЗаписи.Комментарий = "Проведен = Ложь";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			ИначеЕсли МенеджерЗаписи.Комментарий <> "" Тогда
				МенеджерЗаписи.Комментарий = "";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;			
				МенеджерЗаписи.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);	
	//Притула Р.В. Конец  13.08.2018
	
КонецПроцедуры
